app/Controllers/Api/Livres.php

    public function update($id = null)
    {
        // TODO 1 : 404 si le livre n'existe pas.
        $livre = $this->model->find($id);
        if (! isset($livre)) {
            return $this->$this->failNotFound("Livre {$id} introuvable");
        }
        // TODO 2 : décider comment traiter PUT (remplacement complet)
        //          et PATCH (modification partielle).
        //          Indice : $this->request->getMethod()
        $methode = $this->request->getMethod();
        $data = $this->request->getJSON(true);;
        if ($methode == "PUT") {
                $data = array_merge([
                'titre'  => null,
                'auteur' => null,
                'annee'  => null,
            ], $data);
        }
          if (! $this->model->update($id, $data)) {
---
UPDATE `livres` SET `annee` = 1995
WHERE `livres`.`id` IN ('4')

   public function delete($id = null)
{
    $livre = $this->model->find($id);

    if ($livre === null) {
        return $this->failNotFound("Livre {$id} introuvable");
    }

    $this->model->delete($id);
---
DELETE FROM `livres`
WHERE `id` IN ('1')