app/Controllers/Api/LivresManuel.php

SELECT *
FROM `livres`
WHERE `livres`.`id` = '1'
---
    public function show($id)
{
    $livre = model(LivreModel::class)->find($id);